Repository: jweiland-net/jwtools2
Catalog: Resources/Private/Language/*.ExtConf.xlf
Languages: de

# typo3EnableUidInPageTree
source: Enable UID in pagetree: Enable this option to show the page UID in front of the title in pagetree. So no need to hover over the page icon anymore.
de: Zeige UID im Seitenbaum: Nach Aktivierung wird die Seiten UID vor dem Seitentitel im Seitenbaum dargestellt. Damit braucht Ihr dann nicht mehr mit der Maus über das kleine Seiten Icon drüberfahren, um an die UID dranzukommen.

# typo3TransferTypoScriptCurrent
source: Transfer TypoScript current: For each record, found by CONTENT, a new instance of ContentObjectRenderer will be created by renderObj. The data property will be filled with the values of the record. The TypoScript current value will be resetted. Activate this option if you want to transfer the parent current value into the sub-property of renderObj.
de: Übertrage TypoScript current: Für jeden Datensatz, der durch CONTENT gefunden wurde, wird bei der Verarbeitung durch renderObj immer eine neue Instanz vom ContentObjectRenderer erzeugt. Die data-Eigenschaft wird mit den Werten des Datensatzes gefüllt während die current-Eigenschaft geleert wird. Nach Aktivierung dieser Option wird der Wert der Eltern current-Eigenschaft mit in die Kind-Eigenschaft (renderObj) übertragen.

# typo3UploadFieldsInTopOfEB
source: Upload Fields in top of EB: The UserTSconfig option uploadFieldsInTopOfEB was removed with TYPO3 8.7.0. Activate this Option to show upload fields in top of ElementBrowser and LinkHandler again.
de: Uploadfelder oberhalb EB anzeigen: Die UserTSconfig Option uploadFieldsInTopOfEB wurde mit TYPO3 8.7.0 entfernt. Aktivieren Sie diese Option, um die Uploadfelder wieder oberhalb des ElementBrowser und des LinkHandlers anzeigen zu lassen.

# typo3RequiredColumnsForFiles
source: Required columns for image files: Enter here columns of the DB tables sys_file and/or sys_file_metadata which are to be regarded as mandatory fields. Files for which these columns are not set are available in the file browser, but cannot be selected.
de: Benötigte Spalten für Bilddateien: Tragen Sie hier Spalten der DB Tabellen sys_file und/oder sys_file_metadata ein, die als Pflichtfelder anzusehen sind. Dateien, bei denen diese Spalten nicht gesetzt sind stehen im Dateibrowser zwar zur Verfügung, können jedoch nicht ausgewählt werden.

# typo3ShowEditButtonInElementInformation
source: Add "Edit" button in the file info view: After activation, an additional "Edit" button is added in the file info view (accessible via the "i" icon), with which you can edit the current file with just one click.
de: "Bearbeiten" Schaltfläche in der Datei-Info-Ansicht hinzufügen: Nach Aktivierung wird in der Datei-Info-Ansicht (erreichbar über das "i" Icon) eine zusätzliche "Bearbeiten" Schaltfläche hinzugefügt, mit der Sie mit nur einem Klick die aktuelle Datei bearbeiten können.

# typo3ExcludeVideoFilesFromFalFilter
source: Exclude hidden video files: If you work with video files, TYPO3 creates .youtube and/or .vimeo files. If a title could not be fetched a file like ".youtube" will be created which is handled as hidden file. Instead of showing all hidden files you can activate this option, to only show these two hidden video types in filelist.
de: Versteckte Video Dateien ausschließen: TYPO3 erstellt für externe Videos Dateien mit der Endung .youtube und/oder .vimeo. Wenn der Videotitel jedoch nicht generiert werden konnte, dann wird eine Datei wie ".vimeo" angelegt, die im Dateisystem als versteckt markiert werden. Anstatt den Redakteuren alle versteckten Datensätze anzeigen zu lassen, kann diese Option aktiviert werden, die nur diese 2 Videotypen in der Filelist anzeigen lässt.

# typo3ApplyFixForMoveTranslatedContentElements
source: Apply patch for #21161: If you move content records from col_pos X to Y the related translated records will not be moved to new col_pos. Activate this feature to solve that problem. See: https://forge.typo3.org/issues/21161
de: Patch für #21161 anwenden: Wenn Sie den Inhalt von col_pos X auf Y verschieben, werden die zugehörigen übersetzten Datensätze nicht auf neue col_pos verschoben. Aktiviere diese Funktion, um dieses Problem zu lösen. Siehe: https://forge.typo3.org/issues/21161

# reduceCategoriesToPageTree
source: Reduce categories to page tree: In case of a multi-domain TYPO3 instances it makes sense to reduce categories in category-tree to PIDs of current page-tree. So, after activating this checkbox you will not see any categories of foreign page-trees anymore. Admin user will still see everything.
de: Reduziere Kategorien auf Seitenbaum: Bei Multi-Domain Instanzen macht es evtl. Sinn die Kategorien innerhalb des Kategorie-Baumes auf die Kategorien des aktuellen Seitenbaumes zu reduzieren. Nach Aktivierung seht Ihr die Kategorien von den anderen Seitenbäumen nicht mehr. Der Admin jedoch sieht immer alles.

# enableExecuteQueryTask
source: Enable SQL-Query Task: With this task you can realize your own recurring SQL-Queries.
de: SQL-Abfrage-Task aktivieren: Mit diesem scheduler Task könnt Ihr Eure eigenen SQL-Abfragen wiederkehrend einrichten.

# enableContextMenuToUpdateFileMetadata
source: Update file metadata: Activates a new context menu item in filelist to create/update the file metadata. It updates create/edit times and width/height of images.
de: Metadaten aktualisieren: Aktiviert einen neuen Kontextmenüeintrag in der Dateiliste, um die Metadaten der Datei zu erstellen/zu aktualisieren. Es aktualisiert die Erstell-/Bearbeitungszeiten sowie die Breite/Höhe der Bilder.

# enableCachingFrameworkLogger
source: Enable Caching Framework Logger: Hooks into the TYPO3 caching framework and parses all data using expression records to be created on the root page (PID: 0). If these match, a log entry is created in var/log/.
de: Caching Framework Logger aktivieren: Hooks in das TYPO3 Caching-Framework und analysiert alle Daten mit Ausdrucksdatensätzen, die auf der Hauptseite erstellt werden (PID: 0). Wenn diese Übereinstimmung besteht, wird ein Log-Eintrag in var/log/erstellt.

# enableLiveSearchPerformanceForAdmins
source: Enable LiveSearch performance: Overwrite LiveSearch class to get more performance for searchresults as admin.
de: Aktivieren Sie die LiveSearch-Performance: Überschreiben Sie die LiveSearch-Klasse, um mehr Leistung für Suchergebnisse als Admin zu erhalten.

# enableReportProvider
source: Enable provider for EXT reports: If EXT:reports is installed it will show additional information about updatable extensions.
de: Anbieter für EXT-Berichte aktivieren: Wenn EXT:reports installiert ist, werden zusätzliche Informationen über aktualisierbare Erweiterungen angezeigt.

# sendUpdatableExtensionsWithSeverity
source: Set severity for report about updatable extensions: If set to "Info" you also have to activate the checkbox "Always send notification mail" in reports scheduler task. If set to "Warning" you can leave "Always send notification mail" unchecked. Please have a look into documentation for more information.
de: Legen Sie den Ernst für den Bericht über aktualisierbare Erweiterungen fest: Wenn Sie auf "Info" setzen, müssen Sie auch das Kontrollkästchen "Immer Benachrichtigung senden" in der Reportplaner-Aufgabe aktivieren. Wenn Sie auf "Warnung" setzen, können Sie "Immer Benachrichtigung senden" nicht markieren. Bitte schauen Sie sich die Dokumentation für weitere Informationen an.

# solrEnable
source: Enable Solr features
de: Aktiviere Solr Features

# solrSchedulerTaskUid
source: Solr scheduler task UID: After activating Solr features, you have to create the new Solr task of this extension in scheduler and insert the UID of this task here.
de: Solr scheduler task UID: Nach Aktivierung der Solr Features müssen Sie die neue Solr Aufgabe dieser Extension im Planer anlegen und die UID dieser Aufgabe dann hier eintragen.

# solrApplyPatches
source: Solr apply patches: There are some bugs in Solr which we have solved. NOTE: These patches are needed for ext solr 9, later version already contain this patch. Activate this checkbox to apply these patches: https://github.com/TYPO3-Solr/ext-solr/pull/2324/ and https://github.com/TYPO3-Solr/ext-solr/pull/2323
de: Solr Patches einbinden: Wir haben ein paar Fehler in solr gefunden. HINWEIS: Diese patches werde nur für ext solr 9 benötigt, spätere versionen enthalten diese bereits. Nach Aktivierung dieser Checkbox werden diese Patches eingebaut: https://github.com/TYPO3-Solr/ext-solr/pull/2324/ und https://github.com/TYPO3-Solr/ext-solr/pull/2323
