Repository: jweiland-net/jwtools2
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# indexqueueworker_title
source: Index Queue Worker
de: Task, um die Solr Index Warteschlange abzuarbeiten

# indexqueueworker_description
source: Processes the items in the Index Queue and sends them to Solr.
de: Verarbeitet einen Item in der Index Queue und sendet ihn an den Solr Server.

# indexqueueworker_field_documentsToIndexLimit
source: Number of documents to index
de: Anzahl der zu indexierenden Dokumente

# indexqueueworker_field_maxSitesPerRun
source: Max sites per run
de: Maximale Anzahl der zu indexierenden Seiten pro Durchlauf

# executeQueryTask.title
source: Execute SQL Query
de: SQL Abfrage ausführen

# executeQueryTask.description
source: With this task you can write your own SQL-Statement which will be executed with each scheduler run
de: Mit diesem Task kannst Du eine beliebige SQL-Abfrage wiederkehrend ausführen lassen.

# executeQueryTask.field.sqlQuery
source: SQL Query
de: SQL Abfrage

# mod.solr.solrFeaturesOverview
source: Module: Solr Overview
de: Modul: Solr Übersicht

# mod.solr.memoryUsageSchedulerTask
source: Current Memory Usage of running jwtools2 Solr Scheduler Task
de: Aktueller RAM-Verbrauch des Solr Scheduler Tasks der jwtools2

# mod.solr.configuredRootPages
source: Root Pages with Solr configuration
de: Root-Seiten mit Solr-Konfiguration
